read_liberty synthesis/NangateOpenCellLibrary_typical.lib
read_verilog optimization/verilog/base/bk/bk8_MAX_AREA_65.v
link_design bk8
write_sdf optimization/sdf/base/bk/bk8_MAX_AREA_65.sdf
exit