read_hdl {dependencies} {adder_file}
set_db library ./NangateOpenCellLibrary_typical.lib
set_db lef_library ./NangateOpenCellLibrary.lef
elaborate
current_design designs/{adder_name}
read_sdc ./hardware_info.sdc
syn_generic
syn_map
syn_opt
write_hdl > synthesized/{syn_file_path}
