yosys -import
read_verilog {dependencies}
#read_liberty synthesis/NangateOpenCellLibrary_typical.lib
hierarchy -check -top {design_name}
synth -top {design_name}
flatten
opt
flatten
opt_clean -purge
exec mkdir -p synthesis/{top_module_dir}
write_verilog -noattr -noexpr synthesis/{top_module}
tee -o synthesis/{top_module_dir}/{design_name}_stats.json stat -json
exit
